Tekla Open API Reference for Tekla Structures 2025
BendSurface Class
 The BendSurface class defines a surface contour that can be used as a bend between two plates
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurface
 Tekla.Structures.Model.ConicalSurface
 Tekla.Structures.Model.CylindricalSurface
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class BendSurface
<SerializableAttribute>
Public MustInherit Class BendSurface
The BendSurface type exposes the following members.
Constructors
Name | Description
BendSurface(Arc, Double, Double)
 Initializes a new instance of the BendSurface class from a base arc, a height and a radius at the top. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
BendSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the BendSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface
BendSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the BendSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the surface). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
BendSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the BendSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the surface).
Top
Properties
Name | Description
CenterLine
 Gets the center line of the bend surface (i.e. the line that crosses every circular cross section of the bend at their center point)
EndFaceNormal1
 Gets the first end face normal.
EndFaceNormal2
 Gets the second end face normal.
IntersectionLine
 Gets intersection line.
InwardCurved
 Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.
LateralBoundary1
 Gets or sets the first lateral boundary
LateralBoundary2
 Gets or sets the second lateral boundary
RotationAxis
 Gets the unit vector that defines the rotation axis (for counter clockwise rotations) of the lateral boundaries of the surface. This axis is always parallel to the direction of the center line.
SideBoundary1
 Gets or sets the first side boundary.
SideBoundary2
 Gets or sets the second side boundary.
Top
See Also
Reference
Tekla.Structures.Model Namespace